** bind elastic ip to new instance
#+begin_src sh
  IID=`aws ec2 describe-instances | jq '.Reservations[] | .Instances[] | {"id": .InstanceId, "state": .State, "ip": .NetworkInterfaces[] | .Association | .PublicDnsName}' | jq -r '.id'`
  IPID=`aws ec2 describe-addresses | jq -r '.Addresses[0] | .AllocationId' `
  aws ec2 associate-address --instance-id "$IID" --allocation-id "$IPID"

#+end_src

#+RESULTS:
| {             |                   |
| AssociationId | eipassoc-24e93840 |
| }             |                   |

